TestEDT/src/InformationRegisters/уа_Котировки/уа_Котировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уа_Котировки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>DefinedType.уа_Цена</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидКотировки</name>
    <type>
      <types>EnumRef.уа_ВидыКотировки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Биржа</name>
    <type>
      <types>CatalogRef.уа_Биржи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦеннаяБумага</name>
    <type>
      <types>CatalogRef.уа_ФинансовыеИнструменты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestEDT/src/InformationRegisters/уа_СоответствияОбъектовУчета/уа_СоответствияОбъектовУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уа_СоответствияОбъектовУчета</name>
  <resources>
    <name>ОбъектУчета</name>
    <type>
      <types>Characteristic.уа_ВидыОбъектовИмпорта</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.уа_Идентификатор</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбъектаИмпорта</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.уа_ВидыОбъектовИмпорта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсточникДанных</name>
    <type>
      <types>CatalogRef.уа_ИсточникиДанных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestEDT/src/Enums/уа_ВидыКотировки/уа_ВидыКотировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уа_ВидыКотировки</name>
  <enumValues>
    <name>РыночнаяЦена2</name>
  </enumValues>
  <enumValues>
    <name>ЦенаСпроса</name>
  </enumValues>
  <enumValues>
    <name>ЦенаПредложения</name>
  </enumValues>
  <enumValues>
    <name>ЦенаНРД</name>
  </enumValues>
  <enumValues>
    <name>Купон</name>
  </enumValues>
  <enumValues>
    <name>Номинал</name>
  </enumValues>
  <enumValues>
    <name>КоличествоСделок</name>
  </enumValues>
  <enumValues>
    <name>СправедливаяСтоимость</name>
  </enumValues>
</mdclass:Enum>

TestEDT/src/Catalogs/уа_ФинансовыеИнструменты/уа_ФинансовыеИнструменты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уа_ФинансовыеИнструменты</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ЦБ_ИнИнвФондов</name>
      <description>Акции (паи, доли) иностранных инвестиционных фондов</description>
    </items>
    <items>
      <name>АкцииИнАО</name>
      <description>Акции иностранных акционерных обществ</description>
    </items>
    <items>
      <name>АкцииРосАО</name>
      <description>Акции российских акционерных обществ</description>
    </items>
    <items>
      <name>ГосЦБ_НаРынкеЦБ</name>
      <description>Государственные ценные бумаги РФ, обращающиеся на рынке ценных бумаг, за исключением  облигаций внешних облигационных займов РФ</description>
    </items>
    <items>
      <name>ГосЦБ_ВыпущПравРФ</name>
      <description>Государственные ценные бумаги РФ, специально выпущенные Правительством РФ</description>
    </items>
    <items>
      <name>ГосЦБ_СубьектовРФ</name>
      <description>Государственные ценные бумаги субъектов Российской Федерации</description>
    </items>
    <items>
      <name>ДепозитныеCертификаты</name>
      <description>Депозитные сертификаты</description>
    </items>
    <items>
      <name>Депозиты</name>
      <description>Депозиты</description>
    </items>
    <items>
      <name>ИнвестиционныеПаи_ПИФ_РФ</name>
      <description>Инвестиционные паи паевых инвестиционных фондов, выданные в соответствии с законодательством РФ</description>
    </items>
    <items>
      <name>ИпотечныеСертификатыУчастияРФ</name>
      <description>Ипотечные сертификаты участия, выпущенные в соответствии с законодательством РФ об ипотечных ценных </description>
    </items>
    <items>
      <name>МНО</name>
      <description>МНО</description>
    </items>
    <items>
      <name>МуниципальныеОблигации</name>
      <description>Муниципальные облигации</description>
    </items>
    <items>
      <name>Недвижимость</name>
      <description>Недвижимость</description>
    </items>
    <items>
      <name>ОблигацииРФ</name>
      <description>Облигации внешних облигационных займов РФ</description>
    </items>
    <items>
      <name>ОблигацииИнКомОрг</name>
      <description>Облигации иностранных коммерческих организаций</description>
    </items>
    <items>
      <name>ОблигацииРосХозОбщ</name>
      <description>Облигации российских хозяйственных обществ (за исключением облигаций с ипотечным покрытием)</description>
    </items>
    <items>
      <name>ОблигацииСИпотечПокрытием</name>
      <description>Облигации с ипотечным покрытием, выпущенные в соответствии с законодательством РФ об ипотечных ценны</description>
    </items>
    <items>
      <name>Прочее</name>
      <description>Прочее</description>
    </items>
    <items>
      <name>ЦБ_МеждународныхФинОрг</name>
      <description>Ценные бумаги международных финансовых организаций</description>
    </items>
    <items>
      <name>ЦБ_ПравительствИнГосударств</name>
      <description>Ценные бумаги правительств иностранных государств</description>
    </items>
  </predefined>
  <attributes>
    <name>CFI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ISIN</name>
    <comment>International Securities Identification Number</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресВнутреннееПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаНоминала</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаЦенныхБумаг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПогашения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодГосРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номинал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемВыпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассификацияЦБ</name>
    <type>
      <types>EnumRef.уа_КлассификацияЦБ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦББР</name>
    <type>
      <types>EnumRef.уа_ТипыЦенныхБумагБР</types>
    </type>
  </attributes>
  <attributes>
    <name>Эмитент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияАктива</name>
    <type>
      <types>EnumRef.уа_КатегорииАктива</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексируемыйНоминал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

TestEDT/src/InformationRegisters/уа_Котировки/Forms/ФормаЗагрузки/Module.bsl
// СОБЫТИЯ ФОРМЫ
#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Макет			= РегистрыСведений.уа_Котировки.ПолучитьМакет("МакетЗагрузки");
	ОбластьЗаголовка= Макет.ПолучитьОбласть("Заголовок");
	ЭтотОбъект.тдЗагрузка.Вывести(ОбластьЗаголовка);
КонецПроцедуры

#КонецОбласти

// КОМАНДЫ ФОРМЫ
#Область КОМАНДЫ_ФОРМЫ

&НаКлиенте
Процедура Загрузить(Команда)
	
	ЗагрузитьКотировки();				
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКотировки()
	
	Состояние("Загрузка данных",,,БиблиотекаКартинок.ДлительнаяОперация48);
	ЗагрузитьДанныеИзТабличногоДокумента();
	Состояние("Выполнена загрузка данных",,,БиблиотекаКартинок.ДлительнаяОперация48);
	ЭтаФорма.Закрыть();
		
КонецПроцедуры 

#КонецОбласти

// Служебные функции
#Область СлужебныеФункции

&НаСервере
Функция ПолучитьСоответствиеСтолбцовТабличногоДокумента()
	СоответствиеСтолбцов = Новый Соответствие;
	
	Макет			= РегистрыСведений.уа_Котировки.ПолучитьМакет("МакетЗагрузки");
	ОбластьСтруктуры= Макет.ПолучитьОбласть("СтруктураТЧ");
	КолвоСтолбцов 	= ОбластьСтруктуры.ШиринаТаблицы;

	Для НомерСтолбца = 1 По КолвоСтолбцов Цикл
		Область = ОбластьСтруктуры.Область(1, НомерСтолбца, 1, НомерСтолбца);
		СоответствиеСтолбцов.Вставить(НомерСтолбца, Область.Текст);
	КонецЦикла;
	
	Возврат СоответствиеСтолбцов;
КонецФункции


&НаСервере
Функция ЗагрузитьДанныеИзТабличногоДокумента()
	ТаблДок = ЭтотОбъект.тдЗагрузка;
	
	КолвоСтрок 		=  ТаблДок.ВысотаТаблицы;
	КолвоСтолбцов 	=  ТаблДок.ШиринаТаблицы;
	
	СтруктураСтолбцов = ПолучитьСоответствиеСтолбцовТабличногоДокумента();
	
	ТЗ = Новый ТаблицаЗначений;
	ТипЦены = Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.уа_Цена.Тип);
	ТЗ.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));  
	ТЗ.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.уа_Идентификатор.Тип)); 
	ТЗ.Колонки.Добавить("СправедливаяСтоимость", ТипЦены);  
	ТЗ.Колонки.Добавить("Купон", ТипЦены);  
	ТЗ.Колонки.Добавить("Номинал", ТипЦены);  
	 
	
	СписокАктивов = Новый Соответствие;
		
	Для НомерСтроки = 2 По КолвоСтрок Цикл  
		Строка = ТЗ.Добавить();
		Для НомерСтолбца = 1 По КолвоСтолбцов Цикл
			ОбластьТД  = ТаблДок.Область(НомерСтроки, НомерСтолбца, НомерСтроки, НомерСтолбца);
			
			Попытка
				Если ТипЗнч(Строка[СтруктураСтолбцов[НомерСтолбца]]) = Тип("Дата") Тогда
					Строка[СтруктураСтолбцов[НомерСтолбца]] = СокрЛП(ОбластьТД.Текст) + " 00:00:00";
				Иначе
					Строка[СтруктураСтолбцов[НомерСтолбца]] = СокрЛП(ОбластьТД.Текст);
				КонецЕсли;	
			Исключение
				
			КонецПопытки;    			
		КонецЦикла; 		

	КонецЦикла;
	
	ЗаполнитьКотировки(ТЗ);
КонецФункции


&НаСервере
Процедура ЗаполнитьКотировки(ТЗ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ Дата, Идентификатор, СправедливаяСтоимость, Купон, Номинал
	|ПОМЕСТИТЬ ТЗ_Котировки
	|ИЗ &ТЗ КАК Т;
	|
	|ВЫБРАТЬ 
	|	К.Дата КАК Период, 
	|	ФИ.Ссылка КАК ЦеннаяБумага,  
	|	ФИ.ВалютаНоминала КАК Валюта,
	|	К.СправедливаяСтоимость, 
	|	К.Купон, 
	|	К.Номинал
	|ИЗ ТЗ_Котировки КАК К
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уа_СоответствияОбъектовУчета КАК СОУ ПО СОУ.Идентификатор = К.Идентификатор 
	|		И СОУ.ВидОбъектаИмпорта = ЗНАЧЕНИЕ(ПланВидовХарактеристик.уа_ВидыОбъектовИмпорта.ФинансовыеИнструменты)
	|		И СОУ.ИсточникДанных = ЗНАЧЕНИЕ(Справочник.уа_ИсточникиДанных.RuData)
	|   ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уа_ФинансовыеИнструменты ФИ ПО ФИ.Ссылка = СОУ.ОбъектУчета	
	|УПОРЯДОЧИТЬ ПО Дата, ЦеннаяБумага АВТОУПОРЯДОЧИВАНИЕ;";	
		
	Запрос.УстановитьПараметр("ТЗ", ТЗ);	
	
	Массив = Новый Массив;

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;		
	КонецЕсли; 
	 
	Котировка = Новый Структура("Период,ВидКотировки,Биржа,ЦеннаяБумага,Валюта,Значение");
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.СправедливаяСтоимость <> 0 Тогда
			Котировка.Период 		= Выборка.Период;
			Котировка.ВидКотировки 	= Перечисления.уа_ВидыКотировки.СправедливаяСтоимость;
			Котировка.Биржа			= Справочники.уа_Биржи.МосковскаяБиржа;
			Котировка.ЦеннаяБумага  = Выборка.ЦеннаяБумага;
			Котировка.Валюта		= Выборка.Валюта;
			Котировка.Значение		= Выборка.СправедливаяСтоимость;			
			РегистрыСведений.уа_Котировки.Обновить(Котировка);
		КонецЕсли; 
		
		Если Выборка.Купон <> 0 Тогда
			Котировка.Период 		= Выборка.Период;
			Котировка.ВидКотировки 	= Перечисления.уа_ВидыКотировки.Купон;
			Котировка.Биржа			= Справочники.уа_Биржи.МосковскаяБиржа;
			Котировка.ЦеннаяБумага  = Выборка.ЦеннаяБумага;
			Котировка.Валюта		= Выборка.Валюта;
			Котировка.Значение		= Выборка.Купон;			
			РегистрыСведений.уа_Котировки.Обновить(Котировка);
		КонецЕсли; 
		
		Если Выборка.Номинал <> 0 Тогда
			Котировка.Период 		= Выборка.Период;
			Котировка.ВидКотировки 	= Перечисления.уа_ВидыКотировки.Номинал;
			Котировка.Биржа			= Справочники.уа_Биржи.МосковскаяБиржа;
			Котировка.ЦеннаяБумага  = Выборка.ЦеннаяБумага;
			Котировка.Валюта		= Выборка.Валюта;
			Котировка.Значение		= Выборка.Номинал;			
			РегистрыСведений.уа_Котировки.Обновить(Котировка);
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры;

#КонецОбласти
